Revit 2026 API

# StructuralAssetMetalReductionFactor Property

---

The reduction factor of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MetalReductionFactor { get; set; }
```
```vb
Public Property MetalReductionFactor As Double
	Get
	Set
```
```cpp
public:
property double MetalReductionFactor {
	double get ();
	void set (double value);
}
```
```fsharp
member MetalReductionFactor : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be Metal to set this property. |

Applies to Metal-based structural assets.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace